# 멀티 DataFrame

- ref: https://pandas.pydata.org/docs/user_guide/merging.html

## 1. pd.concat
- 합치기(join x)
- axis=0 : 데이터프레임을 밑으로 합침

In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)


df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)

df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)

In [3]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [4]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [5]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [6]:
# df_list = []
# df_list.append(df1)
# df_list.append(df2)
# df_list.append(df3)
# df_list

In [7]:
df_list=[df1,df2,df3] #리스트에 프레임 넣기
df_list

[    A   B   C   D
 0  A0  B0  C0  D0
 1  A1  B1  C1  D1
 2  A2  B2  C2  D2
 3  A3  B3  C3  D3,
     A   B   C   D
 4  A4  B4  C4  D4
 5  A5  B5  C5  D5
 6  A6  B6  C6  D6
 7  A7  B7  C7  D7,
       A    B    C    D
 8    A8   B8   C8   D8
 9    A9   B9   C9   D9
 10  A10  B10  C10  D10
 11  A11  B11  C11  D11]

### 1.1 <font size=6 color='red'><b> 상당히 중요하고 좋은 문법</font></b><br>
- <font color='red'><b>df = pd.concat([df1,df2,df3])</font><b>
- 대용량일 경우 수초면 끝나는 효율적인 속도

In [8]:
df = pd.concat(df_list)
df

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### 1.2 <font color='red'><b> 주의 사항 </font><b>
    
- 프레임과 프레임을 더하면 값을 합친다
- 인덱스 값이 다른 경우는 합쳐지지 않음

In [9]:
df111 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)
df222 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[0, 1, 2, 3],
)
res = df111 + df222  
res

      A     B     C     D
0  A0A4  B0B4  C0C4  D0D4
1  A1A5  B1B5  C1C5  D1D5
2  A2A6  B2B6  C2C6  D2D6
3  A3A7  B3B7  C3C7  D3D7

### 1.3 요소

<pre>
pd.concat(
    objs,
    axis=0,  -> 0 : 밑으로 합치기, 1: 옆으로 합치기
    join="outer",  -->기본 'outer join' : 키의 여부와 상관없이 합침, 없는 값은 null -->full outer join
                   -->'inner join' : 인덱스키가 동일한 것만 합침
    ignore_index=False,  -->인덱스값이 다른 경우 앞의 인덱스에 맞춤 : 옆으로 합침
    keys=None,
    levels=None,
    names=None,
    verify_integrity=False,
    copy=True,
)

## 2 DB 연결해서 DataFrame 만들기

### 2.1 csv파일이 있는 경우

In [10]:
emp = pd.read_csv("./lec08_emp.csv", parse_dates=['HIREDATE'])
emp.head(3)

   EMPNO  ENAME       JOB     MGR   HIREDATE   SAL   COMM  DEPTNO
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30

### 2.2 DB 연결해서 읽는 경우 (pd.read_sql)
<pre>
<b>pandas.read_sql(sql, con, index_col=None, parse_dates=None, columns=None,</b>
        , coerce_float=True, params=None, chunksize=None)

- Warning(경고) 핑크박스 안나오게 할 경우 사용

In [11]:
import warnings
warnings.filterwarnings(action='ignore')

- 오라클 연결

In [12]:
import cx_Oracle
conn = cx_Oracle.connect("ai", "0000", "localhost:1521/XE")
if bool(conn) :
    print(conn, "ok")
else:
    print("Fail")

<cx_Oracle.Connection to ai@localhost:1521/XE> ok

#### 2.2.1 emp

In [13]:
sql="select * from emp"
empdf=pd.read_sql(sql,conn
                  ,parse_dates=['HIREDATE']
                  )
empdf.columns=empdf.columns.str.lower()
empdf.head(3)

   empno  ename       job     mgr   hiredate     sal   comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800.0    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600.0  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250.0  500.0      30

In [14]:
empdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   empno     14 non-null     int64
 1   ename     14 non-null     object
 2   job       14 non-null     object
 3   mgr       13 non-null     float64
 4   hiredate  14 non-null     datetime64[ns]
 5   sal       14 non-null     float64
 6   comm      4 non-null      float64
 7   deptno    14 non-null     int64
dtypes: datetime64[ns](1), float64(3), int64(2), object(2)
memory usage: 1.0+ KB

- 데이터프레임 타입 변환

In [15]:
empdf['sal'] = empdf['sal'].astype('int')
empdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   empno     14 non-null     int64
 1   ename     14 non-null     object
 2   job       14 non-null     object
 3   mgr       13 non-null     float64
 4   hiredate  14 non-null     datetime64[ns]
 5   sal       14 non-null     int32
 6   comm      4 non-null      float64
 7   deptno    14 non-null     int64
dtypes: datetime64[ns](1), float64(2), int32(1), int64(2), object(2)
memory usage: 968.0+ bytes

In [16]:
empdf.head(3)

   empno  ename       job     mgr   hiredate   sal   comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30

- 데이터프레임 결측 처리

In [17]:
empdf.isna().sum().sort_values(ascending=False)

comm        10
mgr          1
empno        0
ename        0
job          0
hiredate     0
sal          0
deptno       0
dtype: int64

In [18]:
empdf.isna().sum() [ empdf.isna().sum() > 0 ].sort_values(ascending=False)

comm    10
mgr      1
dtype: int64

In [19]:
empdf[['comm','mgr']]=empdf[['comm','mgr']].fillna(0)

In [20]:
empdf.isna().sum() [ empdf.isna().sum() > 0 ].sort_values(ascending=False)

Series([], dtype: int64)

#### 2.2.2 dept

In [21]:
sql= "select * from dept"
deptdf=pd.read_sql(sql,conn)
deptdf.columns=deptdf.columns.str.lower()
deptdf.head()

   deptno       dname       loc
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON

In [22]:
deptdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   deptno  4 non-null      int64
 1   dname   4 non-null      object
 2   loc     4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

## 3. pd.Merge
- concat + join

<pre>
------how---------
left : LEFT OUTER JOIN
right : RIGHT OUTER JOIN
outer : FULL OUTER JOIN

inner : INNER JOIN


<b>pd.merge(
    left,   --> how='outer' 일 경우 필요
    right,
    how="inner",
    
    on=None,      -->연결할 키
    left_on=None, -->두 프레임 간 연결할 키의 이름이 다른경우 설정
    right_on=None,
                
                -->left_on/right_on 혹은 left_index/right_index 중 선택하여 사용해야함
    
    
    left_index=False, -->키로 연결할 수 없을 때 사용 , True 인덱스끼리 연결, right_index 와 함께 사용
    right_index=False,</b>
    ----------------------------------------------------------------------
    sort=True,
    suffixes=("_x", "_y"), --> 두 프레임 간 동일한 컬럼명이 있을 때 이름 설정
    copy=True,
    indicator=False,
    validate=None,
)

### 3.1 inner join

<pre>
1.오라클
select e.empno, e.ename, d.deptno, d.dname from emp e, dept d
where e.deptno=d.detpno;

2.ANSI
select e.empno, e.ename, d.deptno, d.dname, from emp e JOIN dept d ON where e.deptno=d.detpno;

In [23]:
# 동일한 컬럼명이 있는경우 오라클은 어느 테이블에 있는지 명시해주어야하지만 데이터프레임에서는 필요없음
df=pd.merge(empdf,deptdf, on="deptno", how="inner") #default 'inner'
df[['empno','ename','deptno','dname']]

    empno   ename  deptno       dname
0    7369   SMITH      20    RESEARCH
1    7566   JONES      20    RESEARCH
2    7788   SCOTT      20    RESEARCH
3    7876   ADAMS      20    RESEARCH
4    7902    FORD      20    RESEARCH
5    7499   ALLEN      30       SALES
6    7521    WARD      30       SALES
7    7654  MARTIN      30       SALES
8    7698   BLAKE      30       SALES
9    7844  TURNER      30       SALES
10   7900   JAMES      30       SALES
11   7782   CLARK      10  ACCOUNTING
12   7839    KING      10  ACCOUNTING
13   7934  MILLER      10  ACCOUNTING

### 3.2 outer join - dept 기준

<pre>

1.오라클
-dept 기준 : 부족한 쪽 컬럼에 (+)

select e.empno, e.ename, d.deptno, d.dname from emp e, dept d
where e.deptno(+)=d.detpno;

2.ANSI
-dept 기준 : 왼쪽/ 오른쪽 누가 기준인지

select e.empno, e.ename, d.deptno, d.dname, from emp e OUTER RIGHT JOIN dept d ON where e.deptno=d.detpno;

In [24]:
#dept 테이블에는 40번부서는 있지만 emp 테이블에는 40번 부서에 해당하는 사람(데이터) 없음
df=pd.merge(empdf,deptdf, on="deptno", how="right")
df[['empno','ename','deptno','dname']].tail()

     empno   ename  deptno       dname
10  7654.0  MARTIN      30       SALES
11  7698.0   BLAKE      30       SALES
12  7844.0  TURNER      30       SALES
13  7900.0   JAMES      30       SALES
14     NaN     NaN      40  OPERATIONS

### 3.3 full outer join

<pre>
1.오라클
-오라클에서는 full outer join 없음 --> 양쪽 (+) 없다

2.ANSI
-dept 기준 : 왼쪽/ 오른쪽 한번씩 기준

select e.empno, e.ename, d.deptno, d.dname, from emp e FULL OUTER JOIN dept d ON where e.deptno=d.detpno;

#### 3.3.1 DataFrame에 데이터 추가

1. 단일리스트
- 50번 부서를 갖는 사원정보 추가

In [25]:
empdf.loc[14] = [9999,'TEMPUSER','CLERK',7902,'1980-12-17 00:00:00',2000,100,66]
empdf.tail(3)

    empno     ename      job     mgr             hiredate   sal   comm  deptno
12   7902      FORD  ANALYST  7566.0  1981-12-03 00:00:00  3000    0.0      20
13   7934    MILLER    CLERK  7782.0  1982-01-23 00:00:00  1300    0.0      10
14   9999  TEMPUSER    CLERK  7902.0  1980-12-17 00:00:00  2000  100.0      66

2. 단일리스트
- 66번 부서를 갖는 사원정보 추가
- dataframe화 시킨 후 concat(..,axis=0)

In [26]:
emp_list = [[9900,'AA','CLERK',7902,'1980-12-17 00:00:00',2000,100,66]] #1차 리스트를 2차로 만들기[[]]
one_row_df = pd.DataFrame(emp_list, columns= empdf.columns)
one_row_df

   empno ename    job   mgr             hiredate   sal  comm  deptno
0   9900    AA  CLERK  7902  1980-12-17 00:00:00  2000   100      66

In [27]:
empdf= pd.concat([empdf,one_row_df],axis=0, ignore_index=True)

In [28]:
empdf.tail()

    empno     ename      job     mgr             hiredate   sal   comm  deptno
11   7900     JAMES    CLERK  7698.0  1981-12-03 00:00:00   950    0.0      30
12   7902      FORD  ANALYST  7566.0  1981-12-03 00:00:00  3000    0.0      20
13   7934    MILLER    CLERK  7782.0  1982-01-23 00:00:00  1300    0.0      10
14   9999  TEMPUSER    CLERK  7902.0  1980-12-17 00:00:00  2000  100.0      66
15   9900        AA    CLERK  7902.0  1980-12-17 00:00:00  2000  100.0      66

3. Series로 가지고 있는 경우

In [29]:
s = pd.Series([7700, 'SSS', 'CLERK', 7902,'1980-12-17', 2000, 100, 66],
             index = empdf.columns)

dd = empdf.append(s.T, ignore_index=True)
dd.tail()

    empno     ename      job     mgr             hiredate   sal   comm  deptno
12   7902      FORD  ANALYST  7566.0  1981-12-03 00:00:00  3000    0.0      20
13   7934    MILLER    CLERK  7782.0  1982-01-23 00:00:00  1300    0.0      10
14   9999  TEMPUSER    CLERK  7902.0  1980-12-17 00:00:00  2000  100.0      66
15   9900        AA    CLERK  7902.0  1980-12-17 00:00:00  2000  100.0      66
16   7700       SSS    CLERK  7902.0           1980-12-17  2000  100.0      66

4. 멀티 리스트 : 여러 건을 추가
- dataframe화 시킨 후 concat(..,axis=0)

In [30]:
empdf.columns

Index(['empno', 'ename', 'job', 'mgr', 'hiredate', 'sal', 'comm', 'deptno'], dtype='object')

In [31]:
add_emp = [[8800, 'TEMPUSER1', 'CLERK', 7902,'1980-12-17', 2000, 100, 66],
           [8801, 'TEMPUSER2', 'CLERK', 7902,'1980-12-17', 2000, 100, 66]]
add_df =pd.DataFrame(add_emp, columns=empdf.columns)# 컬럼이름 가져와서 지정
add_df

   empno      ename    job   mgr    hiredate   sal  comm  deptno
0   8800  TEMPUSER1  CLERK  7902  1980-12-17  2000   100      66
1   8801  TEMPUSER2  CLERK  7902  1980-12-17  2000   100      66

In [32]:
empdf= pd.concat([empdf,add_df],axis=0, ignore_index=True)

In [33]:
empdf.tail()

    empno      ename    job     mgr             hiredate   sal   comm  deptno
13   7934     MILLER  CLERK  7782.0  1982-01-23 00:00:00  1300    0.0      10
14   9999   TEMPUSER  CLERK  7902.0  1980-12-17 00:00:00  2000  100.0      66
15   9900         AA  CLERK  7902.0  1980-12-17 00:00:00  2000  100.0      66
16   8800  TEMPUSER1  CLERK  7902.0           1980-12-17  2000  100.0      66
17   8801  TEMPUSER2  CLERK  7902.0           1980-12-17  2000  100.0      66

#### 3.3.2 데이터 추가 후 full outer join

- 66번 부서 사원 정보를 몇건 추가 후 full outer join

In [34]:
fdf=pd.merge(empdf, deptdf, on='deptno', how='outer')
fdf[['empno','ename','deptno','dname']].sort_values('deptno').tail(6)

     empno      ename  deptno       dname
5   7499.0      ALLEN      30       SALES
18     NaN        NaN      40  OPERATIONS
14  9999.0   TEMPUSER      66         NaN
15  9900.0         AA      66         NaN
16  8800.0  TEMPUSER1      66         NaN
17  8801.0  TEMPUSER2      66         NaN

## 4. Join ------> 비추